def menu():
    print('==========================================')
    print('\n Выберите операции из списка:           '
          '\n 1 - добавление заметки                 '
          '\n 2 - удаление заметки                   '
          '\n 3 - редактирование заметки             '
          '\n 4 - найти заметку по дате введения     '
          '\n 5 - найти заметку по идентификатору    '
          '\n 6 - показать все введенные заметки     '
          '\n 0 - выход                              ')
    print('==========================================')
    print ('\n Введите номер нужной операции: ')